entries/archive.org
#+hugo_base_dir: ../
#+startup: content
#+macro: latex @@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>X</span>@@
#+options: ^:{}
#+macro: srclink (eval (org-hugo-get-link-to-orgfile "https://github.com/takaxp/blog/blame/master/entries/" "see Orgfile"))
#+link: files https://pxaka.tokyo/blog/files/

** DONE C-g した場所をブックマークする                               :@emacs:
   CLOSED: [2019-10-05 Sat 17:07]
:PROPERTIES:
:EXPORT_FILE_NAME: 7f6518aa-bab0-91a4-53b3-ba3b8f02a481
:EXPORT_HUGO_TAGS: "emacs" "ah" "hook"
:EXPORT_HUGO_LASTMOD: [2021-02-11 Thu 10:32]
:EXPORT_HUGO_IMAGES: 
:ID:       0F42FE16-6068-445C-A557-9395DA021D9C
:CREATED:  [2019-10-05 Sat 17:00]
:END:

=isearch= した後に =C-g= してしまう癖がどうも抜けず，その度にカーソル位置が初期化されて困っていました．正解は， =RET= の押下で =isearch-exit= を呼び出すことですが，なかなか慣れません．

そこで，万が一 =C-g= で初期位置にカーソルが飛んでしまっても，その直前にすぐカーソルを戻せるようにブックマークするようにしました．

拙作の =ah.el= に当該の =hook= を加えることで， =C-g= に反応するイベントを簡単に追加できます．

 - [[https://github.com/takaxp/ah][takaxp/ah: Additional hooks for Emacs]]

#+begin_src emacs-lisp
(defvar my-cg-bookmark "c-g-point-last")
(defun my-cg-bookmark ()
  (push-mark)
  (when (and buffer-file-name
             isearch-mode)
    (bookmark-set my-cg-bookmark)))
(when (require 'ah nil t)
  (add-hook 'ah-before-c-g-hook #'my-cg-bookmark)
  (ah-mode 1))
#+end_src

=C-g= で万が一カーソルが飛んでしまったら， =M-x list-bookmarks= 或いは =M-x counsel-bookmark= から =my-ag-bookmark= に設定したブックマークを選択すれば，一発でカーソルを移動できます．

便利！

*** updates
 - [2021-02-11 Thu] =mark= を記録するように改良
 - [2019-10-06 Sun] =buffer-file-name= を確認するように改良
 - [2019-11-18 Mon] =isearch-mode= を確認するように改良
